# Create a Python connection with SQL database and retrieve the results of the last two queries (also mentioned below) as dataframes:

In [2]:
import mysql.connector

In [3]:
from mysql.connector import connect
from getpass import getpass

In [4]:
db = connect(
        host= "localhost",
        user = "root",
        passwd = getpass("Enter password: "),
        database= "sakila"
   )

Enter password:  ············

# Check the number of rentals for each customer for May

In [9]:
cursor = db.cursor()
query_may = 'select customer_id, count(rental_id) as number_of_rentals_may from rentals_may group by customer_id;'
cursor.execute(query_may)

In [10]:
import pandas as pd

In [11]:
database_may = pd.DataFrame(cursor.fetchall())
database_may

       0  1
0    130  2
1    459  1
2    408  3
3    333  1
4    222  5
..   ... ..
515  191  2
516  351  1
517   10  1
518  136  1
519   61  1

[520 rows x 2 columns]

# Check the number of rentals for each customer for June

In [12]:
cursor = db.cursor()
query_june = 'select customer_id, count(rental_id) as number_of_rentals_june from rentals_june group by customer_id;'
cursor.execute(query_june)

In [14]:
database_june = pd.DataFrame(cursor.fetchall())
database_june

       0  1
0    416  5
1    516  6
2    239  5
3    285  3
4    310  6
..   ... ..
585  412  1
586  335  1
587  226  2
588   22  1
589  126  1

[590 rows x 2 columns]

# Write a function that checks if customer borrowed more or less films in the month of June as compared to May.